src/Catalogs/Свойства/Свойства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Свойства</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Объекты</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индексирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КвалификаторыЧисла_Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвалификаторыЧисла_Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвалификаторыЧисла_Неотрицательное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КвалификаторыСтроки_Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвалификаторыСтроки_Фиксированная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КвалификаторыДаты_Состав</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Авторегистрация</name>
    <comment>Признак авторегистрации элемента состава плана обмена; Истина – авторегистрация разрешена; Ложь – запрещена</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыСвойств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Типы</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.Объекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Свойства/ManagerModule.bsl
// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Владелец");
	Результат.Добавить("Синоним");
	Результат.Добавить("Комментарий");
	Результат.Добавить("Использование");
	Результат.Добавить("Индексирование");
	Результат.Добавить("КвалификаторыЧисла_Длина");
	Результат.Добавить("КвалификаторыЧисла_Точность");
	Результат.Добавить("КвалификаторыЧисла_Неотрицательное");
	Результат.Добавить("КвалификаторыСтроки_Длина");
	Результат.Добавить("КвалификаторыСтроки_Фиксированная");
	Результат.Добавить("КвалификаторыДаты_Состав");
	Результат.Добавить("Авторегистрация");
	Результат.Добавить("Вид");
	Результат.Добавить("ТипыСтрокой");
	Результат.Добавить("Типы");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()
